{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "30"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_4_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_4_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_5_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_5_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_6_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_6_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_7_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_7_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/flatten_1_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/output_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_4_1/Relu", "op": "_FusedConv2D", "input": ["inputs", "StatefulPartitionedCall/functional_1_1/conv2d_4_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/conv2d_4_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/max_pooling2d_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1_1/conv2d_4_1/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_5_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1_1/max_pooling2d_4_1/MaxPool2d", "StatefulPartitionedCall/functional_1_1/conv2d_5_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/conv2d_5_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/max_pooling2d_5_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1_1/conv2d_5_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_6_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1_1/max_pooling2d_5_1/MaxPool2d", "StatefulPartitionedCall/functional_1_1/conv2d_6_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/conv2d_6_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/max_pooling2d_6_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1_1/conv2d_6_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_7_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_1_1/max_pooling2d_6_1/MaxPool2d", "StatefulPartitionedCall/functional_1_1/conv2d_7_1/convolution/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/conv2d_7_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/max_pooling2d_7_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/functional_1_1/conv2d_7_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_1_1/flatten_1_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1_1/max_pooling2d_7_1/MaxPool2d", "StatefulPartitionedCall/functional_1_1/flatten_1_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_4_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1_1/flatten_1_1/Reshape", "StatefulPartitionedCall/functional_1_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_5_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1_1/dense_4_1/Relu", "StatefulPartitionedCall/functional_1_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/dense_5_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1_1/dense_5_1/Relu", "StatefulPartitionedCall/functional_1_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/dense_7_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1_1/dense_5_1/Relu", "StatefulPartitionedCall/functional_1_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1_1/dense_6_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1_1/dense_7_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_1_1/dense_6_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1_1/output_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1_1/dense_6_1/Sigmoid", "StatefulPartitionedCall/functional_1_1/dense_7_1/Softmax", "StatefulPartitionedCall/functional_1_1/output_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1_1/output_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/Cast/ReadVariableOp", "shape": [128, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_6_1/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_4_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_4_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_5_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_5_1/Squeeze", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_6_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_6_1/Squeeze", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_7_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/conv2d_7_1/Squeeze", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/flatten_1_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_4_1/Cast/ReadVariableOp", "shape": [8192, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_5_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_5_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/Cast/ReadVariableOp", "shape": [128, 26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/dense_7_1/BiasAdd/ReadVariableOp", "shape": [26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1_1/output_1/concat/axis", "shape": [], "dtype": "int32"}]}]}